Unit/src/Catalogs/MockServiceData/MockServiceData.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>MockServiceData</name>
  <basedOn>Catalog.ServiceExchangeHistory</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Query_Type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Query_ResourceAddress</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Query_Body</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Query_BodyMD5</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Query_BodyAsFilter</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Query_BodySize</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Query_BodyType</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Answer_Message</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Answer_StatusCode</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Answer_Body</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Answer_BodySize</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Answer_BodyType</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Query_Headers</name>
    <attributes>
      <name>VariableName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Key</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ValueAsFilter</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Query_Variables</name>
    <attributes>
      <name>VariableName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ValueAsFilter</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Query_AddressParts</name>
    <attributes>
      <name>VariableName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PartNumber</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Query_BodyVariables</name>
    <attributes>
      <name>VariableName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PathToValue</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Answer_Headers</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Unit/src/Catalogs/ServiceExchangeHistory/ServiceExchangeHistory.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ServiceExchangeHistory</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Time</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>QueryType</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>StatusCode</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ResourceAddress</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Headers</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>HeadersMD5</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Body</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>BodyMD5</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BodySize</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BodyType</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Unit/src/Catalogs/MockServiceData/ObjectModule.bsl
// @strict-types

Procedure Filling(FillingData, StandartProcessing) 

	If TypeOf(FillingData) = Type("CatalogRef.ServiceExchangeHistory") Then
		
		InputQuery = FillingData;
		InputAnswer = FillingData;
		If FillingData.Parent.IsEmpty() Then
			Selection = Catalogs.ServiceExchangeHistory.Select(InputQuery,,, "Time desc");
			If Selection.Next() Then
				InputAnswer = Selection.Ref;
			EndIf;
		Else
			InputQuery = FillingData.Parent;
		EndIf;
		
		Description = InputQuery.Description;
		
		Query_Type = InputQuery.QueryType;
		Query_ResourceAddress = InputQuery.ResourceAddress;
		Query_Body = InputQuery.Body;
		Query_BodyMD5 = InputQuery.BodyMD5;

		HeadersValue = InputQuery.Headers.Get();
		If TypeOf(HeadersValue) = Type("Map") Then
			For Each KeyValue In HeadersValue Do
				QueryHeaderRow       = Query_Headers.Add();
				QueryHeaderRow.Key   = String(KeyValue.Key);
				QueryHeaderRow.Value = String(KeyValue.Value);
			EndDo;
		EndIf;
		
		Answer_Message = InputAnswer.ResourceAddress;
		Answer_StatusCode = InputAnswer.StatusCode;
		Answer_Body = InputAnswer.Body;

		HeadersValue = InputAnswer.Headers.Get();
		If TypeOf(HeadersValue) = Type("Map") Then
			For Each KeyValue In HeadersValue Do
				AnswerHeaderRow       = Answer_Headers.Add();
				AnswerHeaderRow.Key   = String(KeyValue.Key);
				AnswerHeaderRow.Value = String(KeyValue.Value);
			EndDo;
		EndIf;
		
	EndIf;

EndProcedure
